/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "settings": {
        "padding_top": 28,
        "padding_bottom": 28
      }
    },
    "multirow_Fniphb": {
      "type": "multirow",
      "blocks": {
        "row_d6kdha": {
          "type": "row",
          "settings": {
            "image": "shopify://shop_images/kevin-headshot-square.jpg",
            "caption": "Founder, owner, CEO, Knifenerd",
            "heading": "Kevin Kent",
            "text": "<p>Knifewear owner and president Kevin Kent’s fascination with handcrafted Japanese knives began while he was working as sous-chef for the legendary chef Fergus Henderson at St. John restaurant in London, England. Back in Canada in 2007 he began selling them out of a backpack from the back of his bicycle, while working as a chef in Calgary. He considers his chef years as the best education for being an entrepreneur. Being a chef takes long hours, involves hard work, both mentally and physically, and chefs must be able to put out fires, both literal and figurative, with extreme competence. Today, Kent is still just as obsessed with Japanese knives as the day he first held one. A couple times a year, he travels to Japan to meet with his blacksmith friends and drinks far too much sake. Each visit he learns more about the ancient art of knife-making. Through this obsession Knifewear has expanded to include six Knifewear stores in Toronto, Calgary, Vancouver, Ottawa, and Edmonton. Plans are also underway to open a store in Kyoto, Japan. He refuses to confess how many Japanese knives he owns … but he admits the number is rather high. If you meet him in person, ask him to tell you his Lou Reed story.</p>",
            "button_label": "",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "row_d6kdha"
      ],
      "settings": {
        "image_height": "medium",
        "desktop_image_width": "medium",
        "heading_size": "h1",
        "text_style": "body",
        "button_style": "secondary",
        "desktop_content_position": "middle",
        "desktop_content_alignment": "left",
        "image_layout": "alternate-left",
        "section_color_scheme": "",
        "row_color_scheme": "",
        "mobile_content_alignment": "left",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multicolumn_37rYXc": {
      "type": "multicolumn",
      "blocks": {
        "column_8RPpUm": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Colin-Calgary.jpg",
            "title": "Colin / Manager",
            "text": "<p>Back in the day Colin cooked at a couple restaurants in Edmonton, and he used to make knives too. He later moved to Toronto and was seduced by a career in music, though he continued sharpening knives for friends and family. By night, he DJ'd and produced beats as Ronin E-Ville, and by day he taught music at several universities, all while training to become a kung fu master. Colin eventually moved to Ireland, working as a music researcher for a couple years and learning to make shillelaghs. Since returning to Canada, Colin is stoked to be getting back to his roots with knives, happily nerding-out on steels, blacksmiths, and sharpening. If you want to know about Chinese-style cleavers (chuka bocho), Colin’s your guy!</p>",
            "link_label": "CCK Cleaver \"Civil And Military\" Kitchen Chopper Knife 215mm - KF1203",
            "link": "shopify://products/cck-cleaver-no-3-civil-and-military-chopper-knife-215mm-kf1203"
          }
        },
        "column_bXqLVy": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Kat_-_Calgary.jpg",
            "title": "Kat / Assistant Manager",
            "text": "<p>Meet Kat! A born and raised Calgarian who joined the Knifewear team after they escaped their life as a manager at a grocery store. They are a lover of flavourful body-builder food who wanted to explore the world of cool kitchen knives. They can often be found attending local shows and throwing themself into the mosh pit. If you ever need advice on which local shows to attend or how to make your recipe allergy friendly then Kat is your person! </p>",
            "link_label": "Masashi VS1 KAIJIN Gyuto 210mm",
            "link": "shopify://products/masashi-vs1-kaijin-gyuto-210mm"
          }
        },
        "column_Pfi9ye": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/connor_2.jpg",
            "title": "Connor",
            "text": "<p>If you like piña coladas and getting caught in the rain, you’re not the type of person for Connor, because he hates both of those things. He’d rather replace those rainy days and slushy drinks with Dungeons and Dragons, metal and punk, and comically bad puns. Connor comes from an industry background, graduating from the culinary program at SAIT, and busting out plates at local joints before making his way to the knife life. There’s good reason that we all refer to him as Sunshine, and you’d be hard-pressed to find someone with a shinier personality and positive mindset. With Connor, we’ve always got Sunshine on a cloudy day.</p>",
            "link_label": "Yu Kurosaki SG2 Senko Ei Bunka 165mm",
            "link": "shopify://products/yu-kurosaki-r2-senko-bunka-165mm"
          }
        },
        "column_LQrLzd": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Masashi_engraving_in-store-46_600x_ffde36a2-5a15-4b46-b15e-183080a144f1.webp",
            "title": "Kyle",
            "text": "<p>Kyle joined us all the way from Manila, Philippines with a prolific background in coffee and photography. He found Knifewear when he used to work at the coffee shop down the street, coming in on his breaks to see cool knives was foreshadowing, and now he's a fellow knifenerd like all of us. His culinary endeavors involve mixing his traditional Filipino food with other cuisines. Catch him on his days off taking incredible photos, looking for hidden local coffee shops and killing a filipino cosplay of Jacob Black 24/7.</p>",
            "link_label": "Sakai Takayuki Homura by Itsuo Doi Kengata Santoku 195mm",
            "link": "shopify://products/sakai-takayuki-kengata-guyto-195mm"
          }
        },
        "column_VyYCzd": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/received_940774684289995.jpg",
            "title": "Maeve",
            "text": "<p>After a few years in the world of rock climbing, Maeve returned to civilization and found their way to Knifewear. An affinity for knives kindled by a lifelong obsession with swords and fantasy literature, you can find them riding their bike around the city, at a local game store playing dungeons and dragons, moshing in the crowd of a nearby punk show or escaping the city for a weekend in the wilderness. Maeve's newest frontier is a culinary one, looking for new food to try or new recipies to hone their fledgling cooking skills.</p>",
            "link_label": "Kisuke Manaka ATS-34 Tsuchime Gyuto 210mm",
            "link": "shopify://products/kisuke-ats-34-tsuchime-gyuto-210mm"
          }
        },
        "column_mzJYQA": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/SamK.jpg",
            "title": "Sam",
            "text": "<p>Sam spent a decade exploring the many provinces of this lovely country before returning to his hometown of Calgary because he liked the weather. After finishing photography school, Sam found himself enamoured by the organized chaos of kitchen life, where he spent many early mornings and late late nights. If you see him in the shop, ask him about his affinity for extremely reactive carbon steel knives, old bicycles, titanium cookware and whether or not a pop tart can be considered a dumpling. </p>",
            "link_label": "Moritaka Ishime Mega Nakiri 165mm",
            "link": "shopify://products/moritaka-ishime-mega-nakiri-165mm"
          }
        },
        "column_Un4E8N": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_6233.jpg",
            "title": "Cory",
            "text": "<p>After tiring of the desolate rain forest of coastal BC, Cory desired sunshine and city vibes. Coming with over a decade of experience in the construction industry they have happily cast away that past life for handmade, shiny, sharp things. Free time is spent with their incredible family and trying to focus on one of many interests (including voice acting, table top games, and music). Want advice on sparky stuff, imaginary monsters, or Japanese kitchen knives, look no further!</p>",
            "link_label": "Mcusta Zanmai Becho VG10 Damascus Chinese Cleaver 180mm",
            "link": "shopify://products/mcusta-zanmai-becho-vg10-damascus-chinese-cleaver-180mm"
          }
        },
        "column_zWFDJb": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/3278531491516643886.jpg",
            "title": "TJ",
            "text": "<p>We’re not really sure where T.J. came from. He apparated one day after Kyle mispronounced the title of his favourite movie 3 times in a row  like some kind of heavy metal poltergeist. He says he’s been cooking and working in restaurants, “for eons immemorial,” but the first restaurant ever opened in 803 C.E. so we assume he’s about that old. This kitchen ghost comes with a plethora of restaurant experience and stories about the industry that all end up sounding like something out of Apocalypse Now. He keeps saying ominous things like, “The Entity approaches soon,” and “The final hour ticks ever closer,” but if you get him talking about obscure heavy metal bands or Lord of the Rings lore he tends to chill out. </p>",
            "link_label": "Suzuki Uchi Hamono Shirogami Kurouchi Single Bevel Nakiri 165mm",
            "link": "shopify://products/suzuki-uchi-hamono-shirogami-kurouchi-single-bevel-nakiri-165mm"
          }
        },
        "column_RdDbJ6": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_20250107_113148_2.jpg",
            "title": "Callum",
            "text": "<p><strong>DON'T GET ME WRONG:</strong> I love the restaurant business. Hell, I'm still in the restaurant business - a lifetime, classically trained chef who, an hour from now, will probably be roasting bones for demi-glace and butchering beef tenderloins in a cellar prep kitchen on lower Park Avenue. I'm not spilling my guts about everything I've seen, learned and done in my long and checkered career as dishwasher, prep drone, fry cook, grillardin, saucier, sous-chef and chef because I'm angry at the business, or because I want to horrify the dining public. I'd still like to be a chef, too, when this thing comes out, as this life is the only life I really know.</p><p>In all seriousness, Callum now works at Knifewear Calgary, happily selling knives, sharpening, and having a social life!</p>",
            "link_label": "Tadafusa Hocho Kobo Santoku 170mm",
            "link": "shopify://products/tadafusa-hocho-kobo-santoku-170mm-hk-2"
          }
        }
      },
      "block_order": [
        "column_8RPpUm",
        "column_bXqLVy",
        "column_Pfi9ye",
        "column_LQrLzd",
        "column_VyYCzd",
        "column_mzJYQA",
        "column_Un4E8N",
        "column_zWFDJb",
        "column_RdDbJ6"
      ],
      "settings": {
        "title": "Calgary",
        "heading_size": "h1",
        "image_width": "full",
        "image_ratio": "square",
        "columns_desktop": 3,
        "column_alignment": "left",
        "background_style": "none",
        "button_label": "",
        "button_link": "",
        "color_scheme": "background-2",
        "columns_mobile": "1",
        "swipe_on_mobile": true,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multicolumn_7YXc6n": {
      "type": "multicolumn",
      "blocks": {
        "column_wLJ7qN": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/edmonton_profile_1_large_f1bb9d70-4f93-4b70-b4df-29433a2d7b9b.jpg",
            "title": "Kris / Manager",
            "text": "<p>A veteran of many great kitchens, Kris spent over a decade chained to stoves cranking out fine dining. After easing back into civil society by cheese mongering he found his way to Knifewear in the summer of 2014. Kris has a soft spot for 210mm Gyutos and an affinity for the amazing Aogami Super. He believes that no kitchen is complete without at least one Koishi.</p>",
            "link_label": "Fujiwara Western Denka Gyuto 150mm",
            "link": "shopify://products/fujiwara-denka-gyuto-150mm"
          }
        },
        "column_eHLXFD": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/edmonton_profile_3_large_f4057db9-39d2-4dda-b11d-239291a98d9e.jpg",
            "title": "Adam / Assistant Manager",
            "text": "<p>After a decade of being chained to the stove, Adam enrolled in the Knifewear Chef Rehab Program, meaning he's <em>almost</em> a normal person! Our resident axe nerd and outdoor enthusiast, he's also a Kiritsuke connoisseur. Stop by with any axe questions or ask him about that time he won third best Donair in Edmonton!</p>",
            "link_label": "Moritaka Ishime Kiritsuke 210mm",
            "link": "shopify://products/moritaka-ishime-kiritsuke-210mm"
          }
        },
        "column_47Hma7": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_7526_2_large_c7d1f5b5-a8bf-4742-b593-7613977a5898.jpg",
            "title": "Steve",
            "text": "<p>Steve came to us from the world of bartending but has quickly realized that awesome Japanese knives are where it’s at. As someone who loves to cook at home, his approach to knives and how to use them is so helpful for everyone who is not a professional chef. He started off with a Masakage Koishi Bunka, and is now adding a Kurosaki Shizuku Gyuto to his collection. It’s safe to say that if Steve can use a sharp knife and not cut himself to pieces, anyone can do it.</p>",
            "link_label": "Shibata Koutetsu R2 Migaki Ko-Bunka 130mm",
            "link": "shopify://products/kotetsu-r2-migaki-ko-bunka-130mm"
          }
        },
        "column_wNxHXf": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/edmonton_profile_4_large_e436f1bd-8d54-4b4b-a6bb-eb6cf59f56ad.jpg",
            "title": "Ai",
            "text": "<p>We’re very proud to have Ai Yamamoto from Kawaguchi-Ko on the team in Edmonton! She left Japan to come to Vancouver in 2004 and has called Edmonton home since 2007. She says getting used to our harsh winters was the biggest challenge to overcome, but she loves it here because of all the friendly Canucks! She fell in love with all our awesome Japanese knives through working at restaurants, both back in Japan and here in Canada. Come see her to exchange recipes for Udon and to share photos of kitty cats!</p>",
            "link_label": "Masakage Zero Bunka 170mm",
            "link": "shopify://products/masakage-zero-bunka-170mm"
          }
        },
        "column_4c8fjN": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Screenshot_20240108_193409_Gallery.jpg",
            "title": "Cole",
            "text": "<p>Hailing from the community of Camrose, Cole came to the city on a cookery quest. Soon to be a graduate of the NAIT Culinary Arts program, he has a hunger for all food-related knowledge. He’s always talking about what he made for dinner last night and planning out his perfect knife kit. When not immersed in the food world you can find him wearing one of his large collection of hoodies, playing video games, and surrounded by his army of plastic robots. The kid is dripping rizz, no cap. </p>",
            "link_label": "Nigara AS/S Tsuchime Kiritsuke Petty 150mm",
            "link": "shopify://products/nigara-as-s-tsushime-kiritsuke-petty-150mm"
          }
        },
        "column_kFFzTy": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_3355.jpg",
            "title": "Brandon",
            "text": "<p>Originally from San Jose in the Golden State of California, Brandon came to Knife Life looking for a way out of the trades. His obsession with pocket knives led him down the obvious path when he started experimenting in the kitchen at home. He is always down to discuss the finer points of slow-cooked pork, carnitas in particular. He loves a good IPA. He has not however had his own burger restaurant despite what you might think when you see his moustache.</p>",
            "link_label": "Masakage Zero Bunka 170mm",
            "link": "shopify://products/masakage-zero-bunka-170mm"
          }
        },
        "column_LGyHxG": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/unnamed_77328cd8-9323-40e2-bc23-03aebd879c24.jpg",
            "title": "Francis",
            "text": "<p>We rescued Francis from brunch service. Now that he's out of the professional kitchen he can better enjoy cooking at home and visiting all the best Korean joints in town. Be sure to ask him about the joys of gochujang or his homemade Chipotle bowls. I don't think anyone gets more excited for new knife day. Beware he'll convince you you need a Masashi Kokuen, and he isn't wrong.</p>",
            "link_label": "Masashi Kuroshu Ko-Bunka 135mm",
            "link": "shopify://products/masashi-kuroshu-ko-bunka-135mm"
          }
        }
      },
      "block_order": [
        "column_wLJ7qN",
        "column_eHLXFD",
        "column_47Hma7",
        "column_wNxHXf",
        "column_4c8fjN",
        "column_kFFzTy",
        "column_LGyHxG"
      ],
      "settings": {
        "title": "Edmonton",
        "heading_size": "h1",
        "image_width": "full",
        "image_ratio": "adapt",
        "columns_desktop": 3,
        "column_alignment": "left",
        "background_style": "none",
        "button_label": "",
        "button_link": "",
        "color_scheme": "",
        "columns_mobile": "1",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multicolumn_pAxEHU": {
      "type": "multicolumn",
      "blocks": {
        "column_hxYGyC": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/image1_67701aa5-8d81-4d43-bf74-af051cfe2faa.jpg",
            "title": "Luca / Manager",
            "text": "<p>Familiar story with this fella, a decade spent in the kitchen led him to Knifewear. Since joining the “Knifewear Restaurant Workers Rehabilitation ProgramTM” he’s back to enjoying actually cooking at home with his wife, who’s really the one in charge in the kitchen. With a fierce love of all things food, particularly pasta, he’s a natural fit with the rest of the crew at the Ottawa shop. Make sure to wave hello when you’re walking down Bank Street and he’s eating lunch on a bench in the sun. </p>",
            "link_label": "Masakage Koishi AS Nakiri 165mm",
            "link": "shopify://products/masakage-koishi-as-nakiri-165mm"
          }
        },
        "column_TpPjHR": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_20230911_131636.jpg",
            "title": "Colleen / Assistant Manager",
            "text": "<p>Colleen has spent the last 12 years cooking professionally, but has loved being in the kitchen since she was 4 (which is when she learned how to make the stellar pancakes she still whips up today). Colleen takes great pride in using all the odd scraps in the fridge to make something beautiful and damn tasty. Colleen spends most of her free time walking her cool rescue dog Wilma, devouring pastries, and counting down the days until she can skate on the canal.</p>",
            "link_label": "Ryusen Fukakuryu Santoku 170mm",
            "link": "shopify://products/ryusen-fukakuryu-santoku-170mm"
          }
        },
        "column_TH8PiE": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_1805.jpg",
            "title": "Robert",
            "text": "<p>A new addition to the Knifewear Rehabilitation Centre for Cooks & Chefs. Robert isn’t very good at talking about himself, but if you get him going on things like sharp knives, cool rock climbs or good music, he may never stop. But when he isn't doing a deep dive into every blacksmith he can, you'll find him climbing rocks, experimenting in the kitchen or listening to rad tunes out in the woods with his dog, Ava</p>",
            "link_label": "Mutsumi Hinoura \"Ajikataya\" Shirogami Stainless Nashiji Hakata 180mm",
            "link": "shopify://products/mutsumi-hinoura-ajikataya-shirogami-stainless-nashiji-hakata-180mm"
          }
        },
        "column_BaLqye": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/9B477C5D-A6E3-4774-8FEF-960E516F0DC4_0406860f-7cd6-4dd3-9ac4-43c672771b33.jpg",
            "title": "Yukari",
            "text": "<p>Yukari loves to relax on the grass and take her time enjoying nature in Canada. However, she is far from boring; she enjoys skiing, scuba diving, traveling, and even earned her marine license! She also has a passion for eating and exploring new foods. With experience working at a fishmonger and teaching Japanese cuisine in her home country, she continues to learn about new dishes after graduating from a culinary program in Ottawa. </p>",
            "link_label": "Moritaka Ishime Nakiri 165mm",
            "link": "shopify://products/moritaka-ishime-nakiri-165mm"
          }
        },
        "column_LwrtLc": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_7890.jpg",
            "title": "Julia",
            "text": "<p>A lover of great meals and cooking it was inevitable Julia would end up working with food.  After culinary school, and time in Ottawa restaurants, she found herself at Knifewear. Now they won’t let her leave! In her spare time she enjoys looking after her orchids and getting them to rebloom, owning too many Spydercos, cooking with super sharp knives, and you can always find her looking out the window when a fun bird goes flying by!</p>",
            "link_label": "Kobayashi SG2 Gyuto 210mm",
            "link": "shopify://products/kobayashi-sg2-gyuto-210mm"
          }
        },
        "column_FMWD4H": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Ottawa_profile_1_large_800x_6f5f32ed-c6b2-4ad9-8f1b-e3f4eca00fd3.jpg",
            "title": "Lordy / Human Resources",
            "text": "<p>Chris is a relocated Maritimer that can be found slinking in and out the back doors of Ottawa's restaurants, often with his daughter in tow. Chris has been a fixture in the Ottawa food scene for the past 10 years and has recently laid down his apron to learn the ways of Knifewear. Chris loves cooking big pieces of meat over a live fire and spends his summer feeding wood into his BBQ, Lemmy Smoke-mister.</p>",
            "link_label": "Moritaka Ishime Kiritsuke 240mm",
            "link": "shopify://products/moritaka-ishime-kiritsuke-210mm"
          }
        }
      },
      "block_order": [
        "column_hxYGyC",
        "column_TpPjHR",
        "column_TH8PiE",
        "column_BaLqye",
        "column_LwrtLc",
        "column_FMWD4H"
      ],
      "settings": {
        "title": "Ottawa",
        "heading_size": "h1",
        "image_width": "full",
        "image_ratio": "adapt",
        "columns_desktop": 3,
        "column_alignment": "left",
        "background_style": "none",
        "button_label": "",
        "button_link": "",
        "color_scheme": "background-2",
        "columns_mobile": "1",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multicolumn_GdChNp": {
      "type": "multicolumn",
      "blocks": {
        "column_bCz4mK": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/in-action_4.jpg",
            "title": "Kasumi / Manager",
            "text": "<p>Originally from Tokyo, Kasumi brings<em>je ne sais quoi</em>to Knifewear. After managing the Calgary store for years, she decided to take on a new challenge in lively Toronto.<br/>Beyond work, Kasumi is a passionate gastronome, always hunting for culinary adventures.<br/>Whether exploring food scenes wherever she travels or perfecting clear ice in her home bar, Kasumi’s love for great food and drink is endless.</p>",
            "link_label": "Tojiro ATELIER Classic VG10 Damascus Sujihiki 270mm",
            "link": "shopify://products/tojiro-atelier-vg10-damascus-sujihiki-270mm"
          }
        },
        "column_9CU8pF": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/image0_5a985c7d-3f44-4a8e-92dd-f6f65047c85c.jpg",
            "title": "Twigg / Assistant manager",
            "text": "<p>With 15 years of experience in the music industry and a few years working in the baking space, Twigg was eager to embark on a fresh venture. Driven by an unwavering commitment to quality over quantity, he discovered a new calling at Knifewear. When not immersed in the world of knives, you'll often find Twigg indulging his passions for watches, medium format cameras, Berserk, and savouring a glass of peanut punch.</p>",
            "link_label": "Masashi Shirogami Kurouchi Makiri 150mm",
            "link": "shopify://products/masashi-shirogami-kurouchi-makiri-150mm"
          }
        },
        "column_XtM7Pf": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/000095820010230810.jpg",
            "title": "Robbie",
            "text": "<p>Here's Robbie! A born and raised Torontonian, he literally put in blood, sweat and tears helping put together the new Toronto shop. After a decade working security at bars, clubs and concerts all across the city, he wanted to get back to his food loving roots. Raised by a career chef, this kid will eat just about anything you put in front of him. He wants to help people find the perfect tools to feed their families, and is diving deep into the Knifewear knowledge of all things sharp. Mom couldn't be more proud!</p>",
            "link_label": "Takamura Akagouhan Gyuto 210mm",
            "link": "shopify://products/takamura-akagouhan-gyuto-210mm"
          }
        },
        "column_VBMmht": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/000098910024230816.jpg",
            "title": "Maddie",
            "text": "<p>After nine years of building stages and setting up lighting for live events and concerts, Maddie finally decided to hang up her steel toes and find something more stable. Knifewear sounded like the perfect fit for someone raised by foodies. Years of building came in handy for helping to make the Toronto store come together from the ground up. Having been a customer of Knifewear for a long time she was excited to have the chance to help others to find the knives she’s been enjoying for so long. An artist, dead head, Trekkie and foodie - you can always find Maddie diving head first into a new project or adventure. </p>",
            "link_label": "Masakage Koishi AS Kamagata 110mm",
            "link": "shopify://products/masakage-koishi-as-kamagata-110mm"
          }
        },
        "column_iVUrci": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/000013600037230907.jpg",
            "title": "Binh An",
            "text": "<p>A new chapter. A new day. After 20 years working as a Chef, Binh An decided it was time to hang up the chef jacket and the daily grind of kitchen life to enjoy a different pace of life. He has refocused himself to hobbies like gardening, curing, fermentation, and other culinary science experiments. Self professed sneaker freak and t-shirt addict. Come talk to him about sharp and shiny stuff or anything related to food. He will probably tell you to go check out some random restaurant or grocery store.</p>",
            "link_label": "Fujiwara Western Denka Petty 150mm",
            "link": "shopify://products/fujiwara-denka-petty-150mm"
          }
        },
        "column_j8TGia": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Screenshot_2024-01-15_at_8.41.20_AM.jpg",
            "title": "Brian",
            "text": "<p><strong>To quote his IMDB page:</strong> Brian J Graham was born in England and grew up in Canada. He has built a successful acting career as a strong character actor And is now selling Japanese knives at Knifewear Toronto. People have described him as a chameleon. He is able to go from cop to bad guy, drug dealer to dad - and now to knife nerd effortlessly. Being born in England he has a great ear and ability for accents.</p><p>He has lived in Japan and around the world, and believes every one deserves a good sharp knife.</p>",
            "link_label": "Haruyuki Kokuto Gyuto 210mm",
            "link": "shopify://products/haruyuki-kokuto-gyuto-210mm"
          }
        },
        "column_jTEXE4": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Head_Shot.png",
            "title": "Kuma",
            "text": "<p>Kuma brings a unique blend of artistry and culinary passion to Knifewear. With a background in both cooking and illustration, Kuma is equally comfortable discussing the fine edge of a blade or the nuances of artistic design. After spending countless hours alone in the studio perfecting his craft, working in customer service offers a refreshing change—he enjoys connecting with people and sharing his love for cooking and knives. Whether you're seeking advice on kitchen tools or curious about how design influences the perfect blade, Kuma is always ready to help you find what you need.  </p>",
            "link_label": "Masashi KOKUEN Ko-Bunka 135mm",
            "link": "shopify://products/masashi-kokuen-ko-bunka-135mm"
          }
        }
      },
      "block_order": [
        "column_bCz4mK",
        "column_9CU8pF",
        "column_XtM7Pf",
        "column_VBMmht",
        "column_iVUrci",
        "column_j8TGia",
        "column_jTEXE4"
      ],
      "settings": {
        "title": "Toronto",
        "heading_size": "h1",
        "image_width": "full",
        "image_ratio": "adapt",
        "columns_desktop": 3,
        "column_alignment": "left",
        "background_style": "none",
        "button_label": "",
        "button_link": "",
        "color_scheme": "",
        "columns_mobile": "1",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multicolumn_pnGP87": {
      "type": "multicolumn",
      "blocks": {
        "column_8xmUEC": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/edmonton_profile_2_large_800x_50e4d5aa-7b83-4ac3-86a8-348c77d7447c.jpg",
            "title": "Owen / Manager",
            "text": "<p>Owen is another ex-chef among our ranks. he has been Chef-ing in Edmonton for around 12 years but gave it up to be a human being again! An avid music lover, he plays guitar, loves Radiohead, and has probably been to about 500 concerts. Oh, and he can most definitely beat you in a game of Street Fighter. come chat with him about football, and steel!</p>",
            "link_label": "Hado Sakai Sumi Bunka 180mm",
            "link": "shopify://products/hado-sakai-sumi-bunka-180mm"
          }
        },
        "column_mWmpKw": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/vancouver_profile_3_large_fd9e3c2e-489c-47ef-aee5-c2aa4bc17da7.jpg",
            "title": "Francis / Assistant Manager",
            "text": "<p>Francis started his Culinary journey under a decade ago. He was always bashed around the kitchen for having the dullest knives and was only good for one purpose, cutting cake. He knew at some point he had to give up his chef whites to see what it was like outside the culinary world. It was only recently that his love for knives began thanks to a certain knife loving cyclist. Now he's all about being sharp.</p>",
            "link_label": "Fujiwara Denka Nakiri 195mm",
            "link": "shopify://products/fujiwara-denka-nakiri-195mm"
          }
        },
        "column_ryfr9f": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/ayumiwebpic.jpg-large_large_8be78f93-c7de-4013-9e59-de186d085ad7.jpg",
            "title": "Ayumi",
            "text": "<p>Hailing from Chiba (also home to Teruyasu Fujiwara) Ayumi moved to Vancouver for a holiday and never went back. When she was 18 she began a cooking career but eventually found her way out of the kitchen and behind the counter at Knifewear Vancouver. Aside from her love of Japanese blades, she's also into fermentation cooking, snowboarding, sewing, and being incredibly pleasant. If you're really nice to her, she may let you try some of her delicious home-brewed Sake!</p>",
            "link_label": "Masashi Kuroshu Ko-Bunka 135mm",
            "link": "shopify://products/masashi-kuroshu-ko-bunka-135mm"
          }
        },
        "column_dFfEWX": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/liam.jpg",
            "title": "Liam",
            "text": "<p>Liam \"Work Milk\" Duplantis is named after one of the Gallagher Brothers and is a huge fan of dairy products in general. He also makes horseradish and kimchi and is generally a pretty pleasant person. He knows a lot about whisk(e)y and thinks knives are neat-o. He has read \"The Silmarillion\", but is kind enough to keep his mouth shut about it. Hi Liam!</p>",
            "link_label": "Hado Sakai Sumi Gyuto 240mm",
            "link": "shopify://products/hado-sakai-sumi-gyuto-240mm"
          }
        },
        "column_NK7aA6": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_3737.jpg",
            "title": "David",
            "text": "<p>David used to be beer people, but now he’s knife people and loving every razor-sharp minute of it. His culinary goal is to cook like a mom or any matriarchal figure really. David is a simple man and thusly enjoys simple man activities: going for long walks, drinking good beer with good friends and watching The Mummy (the Brendan Fraser masterpiece, obviously). Come to the shop and talk with him about restaurants, music, life or even about your problems, he’s a good listener!</p>",
            "link_label": "Fujiwara Maboroshi Gyuto 195mm",
            "link": "shopify://products/fujiwara-maboroshi-gyuto-195mm"
          }
        },
        "column_dydLmh": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_5066.jpg",
            "title": "Regann",
            "text": "<p>Regann Leavitt (January 19, 1809 – October 7, 1849) was an American writer, poet, editor, and literary critic. Leavitt is best known for their poetry and short stories, particularly their tales of mystery and the macabre. They are widely regarded as a central figure of Romanticism in the United States, and of American literature.</p><p></p><p>Upon further inspection, this appears to be the wikipedia entry for famed American writer Edgar Allen Poe. Thanks Regann!</p>",
            "link_label": "Nigara SG2 Kurouchi Tsuchime Wa Gyuto 240mm",
            "link": "shopify://products/nigara-sg2-kurouchi-tsuchime-gyuto-240mm"
          }
        },
        "column_mAJYCe": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_3946.jpg",
            "title": "Thinh",
            "text": "<p>With a background in leathercraft and vintage fashion, Thinh brings a unique perspective and sharp eye for detail to Knifewear. While he may not be much of a cook in the kitchen, he can do a mean BBQ—especially beef ribs, or as he calls them, \"brisket on a stick\". He’s also an avid collector of leather jackets from the 1930s to the 1960s, currently on a side quest to find that iconic Durable jacket Marlon Brando wore in The Wild One. An aspiring knife nerd by day and a true Americana enthusiast by night, Thinh is your go-to for finding the perfect Japanese blade or talking about all things vintage and BBQ. Don’t be shy now—come holla at ya boy!</p>",
            "link_label": "",
            "link": ""
          }
        }
      },
      "block_order": [
        "column_8xmUEC",
        "column_mWmpKw",
        "column_ryfr9f",
        "column_dFfEWX",
        "column_NK7aA6",
        "column_dydLmh",
        "column_mAJYCe"
      ],
      "settings": {
        "title": "Vancouver",
        "heading_size": "h1",
        "image_width": "full",
        "image_ratio": "adapt",
        "columns_desktop": 3,
        "column_alignment": "left",
        "background_style": "none",
        "button_label": "",
        "button_link": "",
        "color_scheme": "background-2",
        "columns_mobile": "1",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multicolumn_Tb6MAn": {
      "type": "multicolumn",
      "blocks": {
        "column_4YiDPh": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/fullsizeoutput_4587_600x_e8862f68-9bbf-49d2-94be-a63298b96d87.webp",
            "title": "Mike / General Manager",
            "text": "<p>Mike was a chef for 15 years and and has been a knife aficionado for most of them. His love of Japanese knives began, coincidentally, when Knifewear began. Mike decided that it was time to get out from behind the stoves and hanging out at Knifewear wasn’t paying the bills so he hired himself. We rehabilitated him into a life of knives and shaving in 2012. He loves to talk about food and cooking as well as knives. Mike is the General Manager of all our shops.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_UbRMrx": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/79534131_1509066292588977_457181738960818628_n_large_2595694d-6db0-4fef-8d04-c2513a9e8f8d.jpg",
            "title": "Ellie / Digital Operations",
            "text": "<p>Ellie is a Shopify expert and tinker with with all types of software solutions. She started selling knives in the store, but saw how things could run more efficiently, and made it so. Ellie is passionate about products (just ask anyone she knows about quality canned seafood) and does her homework on every single item she purchased for herself and the store. In her free time you can find her arguing about mop buckets and planting the seeds of queer femme joy wherever she goes.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_xahXGK": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/naoto_possible_1_of_1_-3.jpg",
            "title": "Naoto / Purchaser and Sharpener",
            "text": "<p>Naoto came to Canada several years ago and we aren't letting him go back. After getting angry with his roommate's dull knives, he started to dream of sharp Japanese knives. Naoto graduated from University of Calgary with a bachelor degree of art, majoring International Relations and finds that selling Japanese knives is his own way of doing international relations. Naoto is our Head of Japanese Relations & Purchasing. You can also see him in our documentary Springhammer looking cool and holding it all together.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_ncGXUt": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/nathan-headshot-2024_1.jpg",
            "title": "Nathan/ Brand Communications Lead",
            "text": "<p>Nathan started at Knifewear in 2013, when he left the restaurant industry to slang knives. Nowadays, he handles our communications, social media, and YouTube channel. If you're reading words on this website or watching one of our videos, Nathan was involved. He spends his spare time growing food, cooking, fermenting food and booze, and enjoying the great outdoors.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_UH4Pai": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/kawaii-but-deadly-3_488d9016-e248-4b21-8772-0e499880adec.jpg",
            "title": "Mason / Brand Design Manager",
            "text": "<p>Mason's job is to make Knifewear and Kent of Inglewood look cool. Which is an easier job than it looks (don't tell Kevin) since both are much cooler than Mason. He enjoys owning knives that make him feel like a much better cook than he actually is, and looking at razors that make him wish he shaved more than once every five years.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_UX8EjY": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/GLIZZYGEDDEN_5_of_6.jpg",
            "title": "Jacob / Brand Communications",
            "text": "<p>Meet Jacob! While bouncing around national parks and the west coast of Canada, one thing remained constant for him, his love of Barbecue. If you see him, feel free to ask him anything smoking related, because he loves a good brisket. Hailing from Calgary, Jacob came back from his adventures to be closer to family, and to go to marketing school. His love of food and sharp things eventually landed him a job at the Inglewood location, where they needed someone to reach stuff off the top shelf. If you see him, you’ll be greeted with a smile and wave, and he’s happy to help you find something that fits you perfectly!</p>",
            "link_label": "Kobayashi SG2 Santoku 170mm",
            "link": "shopify://products/kobayashi-sg2-santoku-170mm"
          }
        },
        "column_wDWBb4": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/skye_knifewear_photo_1_of_1_600x_a0977aa1-ce88-49bb-aba1-b69fe78d79df.webp",
            "title": "Skye / Brand Communications",
            "text": "<p>With a background as a professional photographer, Skye has done more than a few light tests with the shiniest knives she can find. Her big passions are food and photography, but ask her anything about cicadas, obscure church plays, or sharp things if you want her to seriously nerd out. Other interests include cozy video game nights in, wild day trips out, and cooking with obscene amounts of really good confit garlic olive oil.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_pBXCf9": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Naomi-Headshot-2024_1.jpg",
            "title": "Naomi  / Operations & Administration Assistant",
            "text": "<p>Naomi comes to us after working for 14 years in childcare, where she strived to create a caring early education environment that allowed children to learn through exploration, risk taking , and with a healthy dose of basic cooking skills. When you need a helping hand Naomi will do everything she can to get you what you need. From running a community pantry and being a serial volunteer in her community, you can count on her to make sure shit gets done.<br/>This makes her a great fit for helping out amazing Knifewear customers. She has a GenX “getter’ done” attitude mixed with the compassion of a kid that got taken down a few too many times in a “friendly” game of Red Rover.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_Hjw8g3": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/IMG_20220204_160645_600x_36c9a481-0977-4a6f-8694-2b5843584d20.webp",
            "title": "Brenda / Operations & Administration Assistant",
            "text": "<p>Brenda’s first passion in life is pizza.  She also loves dinosaurs, Ninja Turtles, crocheting and cycling.  She is wildly talented at customer service, and is the fastest in the West at quick draw telephone pick-up.  She’s usually the one you talk to when you call the warehouse, she is amazing at solving a shipping problem, and sometimes she brings cookies to work which makes her team happy.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_Uqc9qq": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/knifewear_merch_launch_1_1_of_8.jpg",
            "title": "Tiffany / Purchaser",
            "text": "<p>What can we say about Tiffany. One day she bought an axe from us, and then another one, and then she decided she wanted to work with sharp stuff all day long! Now she's crushing it running the warehouse, making sure that your packages get out in a timely manner. Tiffany has no problem getting her hands dirty out and about with axes, knives, and here in the shop sharpening. When you need insight on your next outdoor excursion, give Tiffany a call.</p>",
            "link_label": "",
            "link": ""
          }
        },
        "column_drTqqR": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/in-action_1.jpg",
            "title": "Matt / Warehouse Manager",
            "text": "<p>Joining us from Manchester, UK, by way of Vancouver, Matt was introduced to Knifewear during the pandemic when West Coast Knife Nerd Ryan hooked up the kitchen with free sharpening (rewarded with a super sexy grilled cheese, of course).  Since then, Matt has put his 10 years of kitchens behind him to get a grip (geddit?) on some awesome knives!  Rocking some colourful tattoos, be sure to ask Matt about mid-west Punk, Pork Belly, and Pizza.</p>",
            "link_label": "Hado Sakai Ginsan Kiritsuke Gyuto 210mm",
            "link": "shopify://products/hado-sakai-ginsan-kiritsuke-gyuto-210mm"
          }
        },
        "column_heVjFC": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/Diana-Headshot-2024.jpg",
            "title": "Diana / Warehouse team",
            "text": "<p>Diana is a digital artist with a sparkling sense of humour, colourful hair and a huge passion for cats. She would have at least three if it weren't for her allergies.  So, instead of becoming a cat lady when she moved to Canada, she became our newest knifenerd.  She has travelled all over, loves sweets and has amazing taste in music.  She is a minimalist, so her favourite knives are the Tojiro Classic for their clean & classy elegance.</p>",
            "link_label": "TOJIRO CLASSIC Gyuto 210mm F-808",
            "link": "shopify://products/tojiro-dp-gyuto-210mm-f-808"
          }
        },
        "column_PLwE8V": {
          "type": "column",
          "settings": {
            "image": "shopify://shop_images/nolan_s_insane_knife_collection.jpg",
            "title": "Nolan / Warehouse team",
            "text": "<p>Nolan was a chef with an extensive knife, spoon, and maybe every other kitchen utensil collection. As his collection grew, he became aware that the only path forward for him was to come to the source of his addiction!  He’s brought his extensive collections and ample cooking knowledge to the warehouse where he truly shines as an ace customer service rep, shipper, receiver and bringer of treats.  </p><p>On top of being awesome for advice on tools, cooking and camping, Nolan has amazing tattoos with great stories behind many of them– you should ask him about the greatest prank ever pulled sometime!</p>",
            "link_label": "",
            "link": ""
          }
        }
      },
      "block_order": [
        "column_4YiDPh",
        "column_UbRMrx",
        "column_xahXGK",
        "column_ncGXUt",
        "column_UH4Pai",
        "column_UX8EjY",
        "column_wDWBb4",
        "column_pBXCf9",
        "column_Hjw8g3",
        "column_Uqc9qq",
        "column_drTqqR",
        "column_heVjFC",
        "column_PLwE8V"
      ],
      "settings": {
        "title": "Warehouse",
        "heading_size": "h1",
        "image_width": "full",
        "image_ratio": "adapt",
        "columns_desktop": 3,
        "column_alignment": "left",
        "background_style": "primary",
        "button_label": "",
        "button_link": "",
        "color_scheme": "",
        "columns_mobile": "1",
        "swipe_on_mobile": false,
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "featured_text_fKYVCb": {
      "type": "featured-text",
      "disabled": true,
      "settings": {
        "title": "And we can't forget this guy....",
        "content": "",
        "button_label": "",
        "button_link": "",
        "text_size": "featured_text",
        "text_alignment": "center",
        "css_class": "",
        "custom_css": ""
      }
    }
  },
  "order": [
    "main",
    "multirow_Fniphb",
    "multicolumn_37rYXc",
    "multicolumn_7YXc6n",
    "multicolumn_pAxEHU",
    "multicolumn_GdChNp",
    "multicolumn_pnGP87",
    "multicolumn_Tb6MAn",
    "featured_text_fKYVCb"
  ]
}
